# -*- org-pretty-entities-include-sub-superscripts: nil; -*-
				 Notes

* Variables in our instruction
** Op, Vj, Vk, Dest, Imm
* RS variables (defined on *Page 97* of 4th edition)
** Op, Qj, Qk, Vj, Vk, Addr, Busy
* Example of RS, ROB, and RegFile given on *Page 110* of 4th edition
* ROB variables (ROB is 1-indexed)
** Busy, Instr, State, Dest, Value
* RegFile variables
** ROB_index, Busy, Value
* Steps involved in instruction execution given on *Page 106* and *Page 113* of 4th edition
* Branch Speculation:
** In issue stage
*** Set the speculative bit of entries after a branch instruction is inserted in the ROB
**** we will keep a *speculation* variable *which will be set* once a branch is inserted into ROB
**** all the entries (at all points of time) will have their speculative bit = speculation variable
** In commit stage, when a branch reaches the head of ROB
*** flush all ROB entries if this branch is mispredicted (by checking the calculated address and the instruction of next instrution in ROB?)
**** *reset* the speculation varibale
**** also, restart issuing instructions from the *correct address* (depending on branch taken or not taken)
*** finish the branch if it is correctly predicted => reset the speculative bit in the successive instructions (until the next branch instruction?)
**** *reset* the speculation variable


#Devesh: Are we taking care of writing result for store operations only when we reach the head? This is because of branch speculation.
* Program Notes
** ExeModule.py
*** _setRSEntryForImm
**** 
* Refactoring Notes
** VVIP Note: Compilation buffer for Simulator.py has 13118 lines
*** Now it is 12656 lines
*** Now it is 6881 lines
** ExeModule.py
   CLOCK: [2012-12-06 Thu 15:21]--[2012-12-06 Thu 16:04] =>  0:43
   CLOCK: [2012-12-06 Thu 14:36]--[2012-12-06 Thu 15:21] =>  0:45
*** TODO Change the name of the module and class
** DONE func_unit.py
*** DONE Unit tests
    CLOCK: [2012-12-06 Thu 16:04]--[2012-12-06 Thu 17:20] =>  1:16
*** DONE Change CompFunc name
** TODO load_store_unit.py
   CLOCK: [2012-12-06 Thu 19:43]--[2012-12-06 Thu 20:14] =>  0:31
   CLOCK: [2012-12-06 Thu 17:20]--[2012-12-06 Thu 18:47] =>  1:27
*** TODO Clean up execute()
** DONE ROB.py
*** DONE Add docstrings
    CLOCK: [2012-12-06 Thu 20:18]--[2012-12-06 Thu 21:21] =>  1:03
*** DONE Change every '10' to ROB_MAX_SIZE
** 
